
%% 求解三节点单元刚度矩阵函数
function K=element_stiffness_matrix(i,p,t,E,mu,t_0)
%p为网格节点，e为网格边缘，t为网格单元,i为单元编号
%p的两列分别为节点的x、y坐标
%t的前三列为节点编号，最后一列为1则为方板单元，为2则为夹杂单元
A=1/2*det([1,p(1,t(1,i)),p(2,t(1,i));1,p(1,t(2,i)),p(2,t(2,i));1,p(1,t(3,i)),p(2,t(3,i))]);
%A为三角形单元的面积
B=zeros(3,6);
%应变-位移矩阵初始化
rotate=[1,2,3,1,2,3];
%轮换辅助矩阵
for n=1:3
    B(1,2*n-1)=1/(A*2)*(p(2,t(rotate(n+1),i))-p(2,t(rotate(n+2),i)));
    B(1,2*n)=0;
    B(2,2*n-1)=0;
    B(2,2*n)=1/(A*2)*(-p(1,t(rotate(n+1),i))+p(1,t(rotate(n+2),i)));
    B(3,2*n-1)=B(2,2*n);
    B(3,2*n)=B(1,2*n-1);
end
%应变-位移矩阵，已进行数值验证，编写正确
E_0=E/(1-mu^2);
mu_0=mu/(1-mu);
D_0=E_0/(1-mu_0^2);
D=D_0*[1,mu_0,0;mu_0,1,0;0,0,(1-mu_0)/2];
S=D*B;
K=B'*S*A*t_0;
end
