%% 等效节点荷载计算函数
function F=equivalent_nodal_load(p,e,sigma,t_0)
%p为网格节点，e为网格边缘，t为网格单元,sigma为分布力,t_0为板厚
%p的两列分别为节点的x、y坐标
%t的前三列为节点编号，最后一列为1则为方板单元，为2则为夹杂单元
%e的前两行为边缘单元中的边缘上的两个点的编号，第5行判断是什么边缘（共7条边缘），第6行判断为是否是夹杂单元，第7行判断边缘是否为曲线（1为曲线）
F=zeros(2*length(p),1);
%初始化等效节点荷载向量
for i=1:length(e)
    if e(5,i)==1
        F(2*e(1,i)-1,1)=F(2*e(1,i)-1,1)+1/2*sigma*t_0*abs(p(2,e(1,i))-p(2,e(2,i)));
        F(2*e(2,i)-1,1)=F(2*e(2,i)-1,1)+1/2*sigma*t_0*abs(p(2,e(1,i))-p(2,e(2,i)));
    elseif e(5,i)==2
        F(2*e(1,i),1)=F(2*e(1,i),1)+1/2*sigma*t_0*abs(p(1,e(1,i))-p(1,e(2,i)));
        F(2*e(2,i),1)=F(2*e(2,i),1)+1/2*sigma*t_0*abs(p(1,e(1,i))-p(1,e(2,i)));
    end
    %根据第5行判断边缘的类型，若为1则为右侧边缘，2则为上侧边缘
end
end






